Revit 2027 API
ParameterTypeId.RbsElecPanelTotalDemandFactorParam Property
 "Total Demand Factor"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecPanelTotalDemandFactorParam { get; }
Public Shared ReadOnly Property RbsElecPanelTotalDemandFactorParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecPanelTotalDemandFactorParam {
	ForgeTypeId^ get ();
}
static member RbsElecPanelTotalDemandFactorParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace